<script setup>
import ChatInput from '../ChatInput/ChatInput.vue';
</script>
<template>
    <div class="chat-popup">
        <div class="chat-popup__inner">
            <div class="chat-popup__header">
                <div class="chat-popup__title"><span>Ч</span>ат бот</div>
            </div>
            <div class="chat-popup__body">
                <div class="chat-popup__wrapper">
                    <div class="chat-popup__date">Сегодня</div>
                    <div class="chat-popup__messeges">
                        <div class="chat-popup__messege --bot">hello world</div>
                        <div class="chat-popup__messege">hello world</div>
                    </div>
                    <div class="chat-popup__search">
                        <svg width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M13.4547 11.8693V5.60612C13.4547 5.30875 13.3366 5.02356 13.1263 4.81329C12.9161 4.60302 12.6309 4.48489 12.3335 4.48489C12.0361 4.48489 11.751 4.60302 11.5407 4.81329C11.3304 5.02356 11.2123 5.30875 11.2123 5.60612V12.3335C11.2123 12.6308 11.3305 12.916 11.5408 13.1262L14.9045 16.4899C15.1159 16.6941 15.3992 16.8071 15.6932 16.8046C15.9871 16.802 16.2684 16.6841 16.4762 16.4762C16.6841 16.2683 16.802 15.9871 16.8046 15.6931C16.8071 15.3991 16.6941 15.1159 16.4899 14.9045L13.4547 11.8693Z" fill="#168DD9"/>
                            <path d="M12.3335 0C9.89416 0 7.50961 0.723347 5.48138 2.07857C3.45314 3.43379 1.87233 5.36002 0.938837 7.61367C0.00534395 9.86732 -0.2389 12.3472 0.23699 14.7396C0.712881 17.1321 1.88753 19.3297 3.6124 21.0546C5.33727 22.7795 7.53489 23.9541 9.92735 24.43C12.3198 24.9059 14.7997 24.6616 17.0533 23.7282C19.307 22.7947 21.2332 21.2138 22.5884 19.1856C23.9436 17.1574 24.667 14.7728 24.667 12.3335C24.6631 9.06363 23.3625 5.9288 21.0503 3.61666C18.7382 1.30451 15.6034 0.00385755 12.3335 0ZM12.3335 22.4245C10.3377 22.4245 8.38668 21.8327 6.72722 20.7239C5.06775 19.6151 3.77436 18.0391 3.01059 16.1952C2.24683 14.3513 2.04699 12.3223 2.43636 10.3648C2.82572 8.40736 3.7868 6.60931 5.19806 5.19805C6.60931 3.78679 8.40736 2.82571 10.3648 2.43635C12.3223 2.04698 14.3513 2.24682 16.1952 3.01059C18.0391 3.77435 19.6151 5.06775 20.7239 6.72721C21.8327 8.38667 22.4245 10.3377 22.4245 12.3335C22.4213 15.0088 21.3571 17.5736 19.4653 19.4653C17.5736 21.3571 15.0088 22.4213 12.3335 22.4245Z" fill="#168DD9"/>
                        </svg>
                        <p class="chat-popup__info">Секунду, ищу контрагентов...</p>
                    </div>
                </div>
                
                <ChatInput />
            </div>
        </div>
        <div class="chat-popup__close">
            <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M26 2L14 14M2 26L14 14M14 14L2 2L26 26" stroke="white" stroke-width="4" stroke-linecap="round" stroke-linejoin="round"/>
            </svg>
        </div>
    </div>
</template>
<style src="./__chat-popup.css" lang="css" />